Edzelf/Basicmac-STM32WLE5/lib/IBM LMIC framework/src/lmic/radio-LoRa-E5.c
// Copyright (C) 2016-2019 Semtech (International) AG. All rights reserved.
// Copyright (C) 2014-2016 IBM Corporation. All rights reserved.
//
// This file is subject to the terms and conditions defined in file 'LICENSE',
// which is part of this source code package.
#include <Arduino.h>
#include "board.h"
#include "hw.h"
#include "lmic.h"
#if defined(BRD_LoRa_E5_radio)
#include <stm32wlxx_hal_subghz.h>               // Interface to radio module

SUBGHZ_HandleTypeDef rhandle ;                  // Handle to access SUBGHZ module
HAL_StatusTypeDef    rstat ;                    // Result SUBGHZ functions

uint16_t   lastIrqStatus = 0 ;                  // Last seen IrqStatus

// Overruled Call-back function used by HAL_SUBGHZ_Init(&handle);
void HAL_SUBGHZ_MspInit ( SUBGHZ_HandleTypeDef* hsubghz )
{
    __HAL_RCC_SUBGHZSPI_CLK_ENABLE() ;          // enable clock to sub-ghz module
    //HAL_NVIC_SetPriority ( SUBGHZ_Radio_IRQn, 0, 0 ) ;
    //HAL_NVIC_EnableIRQ ( SUBGHZ_Radio_IRQn ) ;
}


void HAL_SUBGHZ_TxCpltCallback ( SUBGHZ_HandleTypeDef* hsubghz )
{
    ASSERT(0) ;
}


void HAL_SUBGHZ_RxCpltCallback ( SUBGHZ_HandleTypeDef* hsubghz )
{
    ASSERT(0) ;
}

void HAL_SUBGHZ_RxTxTimeoutCallback ( SUBGHZ_HandleTypeDef* hsubghz )
{
    ASSERT(0) ;
}


// ----------------------------------------
// Commands Selecting the Operating Modes of the Radio
#define CMD_SETSLEEP                    0x84
#define CMD_SETSTANDBY                  0x80
#define CMD_SETFS                       0xC1
#define CMD_SETTX                       0x83
#define CMD_SETRX                       0x82
#define CMD_STOPTIMERONPREAMBLE         0x9F
#define CMD_SETRXDUTYCYCLE              0x94
#define CMD_SETCAD                      0xC5
#define CMD_SETTXCONTINUOUSWAVE         0xD1
#define CMD_SETTXINFINITEPREAMBLE       0xD2
#define CMD_SETREGULATORMODE            0x96
#define CMD_CALIBRATE                   0x89
#define CMD_CALIBRATEIMAGE              0x98
#define CMD_SETPACONFIG                 0x95
#define CMD_SETRXTXFALLBACKMODE         0x93

// Commands to Access the Radio Registers and FIFO Buffer
#define CMD_WRITEREGISTER               0x0D
#define CMD_READREGISTER                0x1D
#define CMD_WRITEBUFFER                 0x0E
#define CMD_READBUFFER                  0x1E

// Commands Controlling the Radio IRQs and DIOs
#define CMD_SETDIOIRQPARAMS             0x08
#define CMD_GETIRQSTATUS                0x12
#define CMD_CLEARIRQSTATUS              0x02
//#define CMD_SETDIO2ASRFSWITCHCTRL       0x9D
//#define CMD_SETDIO3ASTCXOCTRL           0x97

// Commands Controlling the RF and Packets Settings
#define CMD_SETRFFREQUENCY              0x86
#define CMD_SETPACKETTYPE               0x8A
#define CMD_GETPACKETTYPE               0x11
#define CMD_SETTXPARAMS                 0x8E
#define CMD_SETMODULATIONPARAMS         0x8B
#define CMD_SETPACKETPARAMS             0x8C
#define CMD_SETCADPARAMS                0x88
#define CMD_SETBUFFERBASEADDRESS        0x8F
#define CMD_SETLORASYMBNUMTIMEOUT       0xA0

// Commands Returning the Radio Status
#define CMD_GETSTATUS                   0xC0
#define CMD_GETRSSIINST                 0x15
#define CMD_GETRXBUFFERSTATUS           0x13
#define CMD_GETPACKETSTATUS             0x14
#define CMD_GETDEVICEERRORS             0x17
#define CMD_CLEARDEVICEERRORS           0x07
#define CMD_GETSTATS                    0x10
#define CMD_RESETSTATS                  0x00


// ----------------------------------------
// List of Registers

#define REG_WHITENINGMSB        0x06B8
#define REG_WHITENINGLSB        0x06B9
#define REG_CRCINITVALMSB       0x06BC
#define REG_CRCINITVALLSB       0x06BD
#define REG_CRCPOLYVALMSB       0x06BE
#define REG_CRCPOLYVALLSB       0x06BF
#define REG_SYNCWORD0           0x06C0
#define REG_SYNCWORD1           0x06C1
#define REG_SYNCWORD2           0x06C2
#define REG_SYNCWORD3           0x06C3
#define REG_SYNCWORD4           0x06C4
#define REG_SYNCWORD5           0x06C5
#define REG_SYNCWORD6           0x06C6
#define REG_SYNCWORD7           0x06C7
#define REG_NODEADDRESS         0x06CD
#define REG_BROADCASTADDR       0x06CE
#define REG_LORASYNCWORDMSB     0x0740
#define REG_LORASYNCWORDLSB     0x0741
#define REG_RANDOMNUMBERGEN0    0x0819
#define REG_RANDOMNUMBERGEN1    0x081A
#define REG_RANDOMNUMBERGEN2    0x081B
#define REG_RANDOMNUMBERGEN3    0x081C
#define REG_RXGAIN              0x08AC
#define REG_TX_CLAMP            0x08D8
#define REG_OCPCONFIG           0x08E7
#define REG_XTATRIM             0x0911
#define REG_XTBTRIM             0x0912
#define SUBGHZ_SMPSC2R          0x0923
// sleep modes
#define SLEEP_COLD              0x00 // (no rtc timeout)
#define SLEEP_WARM              0x04 // (no rtc timeout)

// standby modes
#define STDBY_RC                0x00
#define STDBY_XOSC              0x01

// regulator modes
#define REGMODE_LDO             0x00
#define REGMODE_DCDC            0x01

// packet types
#define PACKET_TYPE_FSK         0x00
#define PACKET_TYPE_LORA        0x01

// crc types
#define CRC_OFF                 0x01
#define CRC_1_BYTE              0x00
#define CRC_2_BYTE              0x02
#define CRC_1_BYTE_INV          0x04
#define CRC_2_BYTE_INV          0x06

// irq types
#define IRQ_TXDONE              (1 << 0)
#define IRQ_RXDONE              (1 << 1)
#define IRQ_PREAMBLEDETECTED    (1 << 2)
#define IRQ_SYNCWORDVALID       (1 << 3)
#define IRQ_HEADERVALID         (1 << 4)
#define IRQ_HEADERERR           (1 << 5)
#define IRQ_CRCERR              (1 << 6)
#define IRQ_CADDONE             (1 << 7)
#define IRQ_CADDETECTED         (1 << 8)
#define IRQ_TIMEOUT             (1 << 9)
#define IRQ_ALL                 0x3FF

// TCXO voltages (limited to VDD - 200mV)
#define TCXO_VOLTAGE1_6V        0x00
#define TCXO_VOLTAGE1_7V        0x01
#define TCXO_VOLTAGE1_8V        0x02
#define TCXO_VOLTAGE2_2V        0x03
#define TCXO_VOLTAGE2_4V        0x04
#define TCXO_VOLTAGE2_7V        0x05
#define TCXO_VOLTAGE3_0V        0x06
#define TCXO_VOLTAGE3_3V        0x07

// XXX: These should probably be configurable
// XXX: The startup time delays TX/RX by 320*15.625=5ms, maybe switch on
// TCXO early?
#define TCXO_VOLTAGE TCXO_VOLTAGE1_7V
#define TCXO_STARTUP_TIME 320 // In multiples of 15.625μs

#define LORA_TXDONE_FIXUP       us2osticks(269) // determined by lwtestapp using device pin wired to sx1301 pps...
#define FSK_TXDONE_FIXUP        us2osticks(0) // XXX
#define FSK_RXDONE_FIXUP        us2osticks(0) // XXX

#define SMPS_DRV_20  ((uint8_t) ((0x0)<<1))
#define SMPS_DRV_40  ((uint8_t) ((0x1)<<1))
#define SMPS_DRV_60  ((uint8_t) ((0x2)<<1))
#define SMPS_DRV_100 ((uint8_t) ((0x3)<<1))
#define SMPS_DRV_MASK ((uint8_t) ((0x3)<<1))
#define SMPS_DRIVE_SETTING_DEFAULT SMPS_DRV_40
#define SMPS_DRIVE_SETTING_MAX SMPS_DRV_60

// XXX
static const u2_t LORA_RXDONE_FIXUP_125[] = {
    [FSK]  =     us2osticks(0),
    [SF7]  =     us2osticks(0),
    [SF8]  =  us2osticks(1648),
    [SF9]  =  us2osticks(3265),
    [SF10] =  us2osticks(7049),
    [SF11] = us2osticks(13641),
    [SF12] = us2osticks(31189),
};

static const u2_t LORA_RXDONE_FIXUP_500[] = {
    [FSK]  = us2osticks(    0),
    [SF7]  = us2osticks(    0),
    [SF8]  = us2osticks(    0),
    [SF9]  = us2osticks(    0),
    [SF10] = us2osticks(    0),
    [SF11] = us2osticks(    0),
    [SF12] = us2osticks(    0),
};

// radio state
static struct {
    unsigned int sleeping:1;
} state;

