Edzelf/Basicmac-STM32WLE5/lib/IBM LMIC framework/src/lmic/radio-LoRa-E5.c
// ----------------------------------------

static void writecmd ( uint8_t cmd, const uint8_t* data, uint8_t len )
{
    state.sleeping = 0 ;
    rstat = HAL_SUBGHZ_ExecSetCmd ( &rhandle, cmd, (uint8_t*)data, len ) ;
    ASSERT ( rstat == HAL_OK ) ;
}

static void WriteRegs ( uint16_t addr, const uint8_t* data, uint8_t len )
{
    state.sleeping = 0;
    rstat = HAL_SUBGHZ_WriteRegisters ( &rhandle, addr, (uint8_t*)data, len ) ;
    ASSERT ( rstat == HAL_OK ) ;
}

static void WriteReg (uint16_t addr, uint8_t val) __attribute__((__unused__)); // Ok if this is unused
static void WriteReg (uint16_t addr, uint8_t val)
{
    WriteRegs ( addr, &val, 1 ) ;
}

static void WriteBuffer ( uint8_t off, const uint8_t* data, uint8_t len )
{
    state.sleeping = 0;
    rstat = HAL_SUBGHZ_WriteBuffer ( &rhandle, off, (uint8_t*)data, len ) ;
    ASSERT ( rstat == HAL_OK ) ;
}

static void readcmd ( uint8_t cmd, uint8_t* data, uint8_t len )
{
    state.sleeping = 0 ;
    rstat = HAL_SUBGHZ_ExecGetCmd ( &rhandle, cmd, data, len ) ;
    ASSERT ( rstat == HAL_OK ) ;
}

static void ReadRegs ( uint16_t addr, uint8_t* data, uint8_t len )
{
    state.sleeping = 0;
    rstat = HAL_SUBGHZ_ReadRegisters ( &rhandle, addr, data, len ) ;
    ASSERT ( rstat == HAL_OK ) ;
}

static uint8_t ReadReg ( uint16_t addr )
{
    uint8_t val ;

    ReadRegs ( addr, &val, 1 ) ;
    return val ;
}

static void ReadBuffer ( uint8_t off, uint8_t* data, uint8_t len )
{
    state.sleeping = 0 ;
    rstat = HAL_SUBGHZ_ReadBuffer ( &rhandle, off, data, len ) ;
    ASSERT ( rstat == HAL_OK ) ;
}


static void Radio_SMPS_Set ( uint8_t level )
{
    uint8_t modReg ;

    modReg = ReadReg ( SUBGHZ_SMPSC2R ) ;
    modReg &= ( ~SMPS_DRV_MASK ) ;
    WriteReg ( SUBGHZ_SMPSC2R, modReg | level ) ;
}


// set sleep mode SLEEP_COLD or SLEEP_WARM (from standby mode)
static void SetSleep ( uint8_t cfg )
{
    Radio_SMPS_Set ( SMPS_DRIVE_SETTING_DEFAULT ) ;
    writecmd ( CMD_SETSLEEP, &cfg, 1 ) ;
    delayMicroseconds ( 500 ) ;
}

// set standby mode STDBY_RC or STANDBY_XOSC
static void SetStandby ( uint8_t cfg )
{
    writecmd ( CMD_SETSTANDBY, &cfg, 1 ) ;
}

// set regulator mode REGMODE_LDO or REGMODE_DCDC
static void SetRegulatorMode ( uint8_t mode )
{
    writecmd ( CMD_SETREGULATORMODE, &mode, 1 ) ;
}

// use DIO2 to drive antenna rf switch
///static void SetDIO2AsRfSwitchCtrl ( uint8_t enable )
///{
///    writecmd(CMD_SETDIO2ASRFSWITCHCTRL, &enable, 1);
///}

// use DIO3 to drive crystal enable switch
///static void SetDIO3AsTcxoCtrl () {
///    uint32_t timeout = TCXO_STARTUP_TIME;
///    uint8_t voltage = TCXO_VOLTAGE1_7V;
///    uint8_t data[] = {voltage, (timeout >> 16) & 0xff, (timeout >> 8) & 0xff, timeout & 0xff };

///    writecmd(CMD_SETDIO3ASTCXOCTRL, data, sizeof(data));
///}

static void SetRfSwitchCtrl ( uint8_t enable )
{
    writecmd ( RADIO_SET_RFSWITCHMODE, &enable, 1 ) ;
}

static void SetTcxoMode()
{
    hal_pin_tcxo ( 1 ) ;                                        // Control radio power
    uint32_t timeout = TCXO_STARTUP_TIME ;
    uint8_t  voltage = TCXO_VOLTAGE1_7V ;
    uint8_t  data[]  = { voltage, ( timeout >> 16)  & 0xff,
                         ( timeout >> 8 ) & 0xff,
                         timeout & 0xff } ;
    writecmd ( RADIO_SET_TCXOMODE, data, sizeof(data));
}

// write payload to fifo buffer at offset 0
static void WriteFifo ( uint8_t *buf, uint8_t len )
{
    static const uint8_t txrxbase[] = { 0, 0 } ;

    writecmd ( CMD_SETBUFFERBASEADDRESS, txrxbase, 2 ) ;
    WriteBuffer ( 0, buf, len ) ;
}

// read payload from fifo, return length
static uint8_t ReadFifo ( uint8_t *buf )
{
    // get buffer status
    uint8_t status[2];
    readcmd ( CMD_GETRXBUFFERSTATUS, status, 2 ) ;

    // read buffer
    uint8_t len = status[0] ;
    uint8_t off = status[1] ;
    ReadBuffer ( off, buf, len ) ;

    // return length
    return len ;
}

// set radio in transmit mode (abort after timeout [1/64ms])
static void SetTx ( uint32_t timeout64ms )
{
    uint8_t timeout[3] = { timeout64ms >> 16, timeout64ms >> 8, timeout64ms } ;
    writecmd ( CMD_SETTX, timeout, 3 ) ;
}

// generate continuous (indefinite) wave
static void SetTxContinuousWave (void)
{
    writecmd ( CMD_SETTXCONTINUOUSWAVE, NULL, 0 ) ;
}

// set radio in receive mode (abort after timeout [1/64ms], or with timeout=0 after frame received, or continuous with timeout=FFFFFF)
static void SetRx ( uint32_t timeout64ms )
{
    uint8_t timeout[3] = { timeout64ms >> 16, timeout64ms >> 8, timeout64ms };
    writecmd ( CMD_SETRX, timeout, 3 ) ;
}

// set radio in frequency synthesis mode
static void SetFs (void)
{
    writecmd ( CMD_SETFS, NULL, 0 ) ;
}

// set radio to PACKET_TYPE_LORA or PACKET_TYPE_FSK mode
static void SetPacketType ( uint8_t type )
{
    writecmd ( CMD_SETPACKETTYPE, &type, 1 ) ;
}

// calibrate the image rejection
static void CalibrateImage ( uint32_t freq )
{
    static const struct {
        uint32_t min;
        uint32_t max;
        uint8_t freq[2];
    } bands[] = {
        { 430000000, 440000000, { 0x6B, 0x6F } },
        { 470000000, 510000000, { 0x75, 0x81 } },
        { 779000000, 787000000, { 0xC1, 0xC5 } },
        { 863000000, 870000000, { 0xD7, 0xDB } },
        { 902000000, 928000000, { 0xE1, 0xE9 } },
    } ;
    for ( size_t i = 0; i < sizeof(bands) / sizeof(bands[0]); i++ )
    {
        if ( freq >= bands[i].min && freq <= bands[i].max )
        {
            writecmd ( CMD_CALIBRATEIMAGE, bands[i].freq, 2 ) ;
        }
    }
}

// set rf frequency (in Hz)
static void SetRfFrequency ( uint32_t freq )
{
    // set frequency
    uint8_t buf[4] ;
    os_wmsbf4 ( buf, (uint32_t) (((uint64_t) freq << 25) / 32000000) ) ;
    writecmd ( CMD_SETRFFREQUENCY, buf, 4 ) ;
}

// configure modulation parameters for LoRa
static void SetModulationParamsLora (u2_t rps)
{
    uint8_t param[4];
    param[0] = getSf(rps) - SF7 + 7;    // SF (sf7 -> 7)
    param[1] = getBw(rps) - BW125 + 4;  // BW (bw125 -> 4)
    param[2] = getCr(rps) - CR_4_5 + 1; // CR (cr45 -> 1)
    param[3] = enDro(rps);     // low-data-rate-opt (symbol time equal or above 16.38 ms)
    writecmd ( CMD_SETMODULATIONPARAMS, param, 4 ) ;
}

// configure modulation parameters for FSK
static void SetModulationParamsFsk (void)
{
    uint8_t param[8];
    param[0] = 0x00; // bitrate 50kbps (32 * fxtal / bitrate = 32 * 32000000 / 50000 = 0x005000)
    param[1] = 0x50;
    param[2] = 0x00;
    param[3] = 0x09; // TX pulse shape filter gaussian BT 0.5
    param[4] = 0x0B; // RX bandwidth 117.3kHz DSB
    param[5] = 0x00; // TX frequency deviation 25kHz (deviation * 2^25 / fxtal = 25000 * 2^25 / 32000000 = 0x006666)
    param[6] = 0x66;
    param[7] = 0x66;
    writecmd ( CMD_SETMODULATIONPARAMS, param, 8 ) ;
}

// configure packet handling for LoRa
static void SetPacketParamsLora (u2_t rps, int len, int inv)
{
    uint8_t param[6];
    param[0] = 0x00 ;               // 8 symbols preamble MSB
    param[1] = 0x08 ;               // 8 bytes preamble LSB
    param[2] = getIh(rps) ;         // Header type: implicit header
    param[3] = len ;                // Payload length
    param[4] = !getNocrc(rps) ;     // CRC mode
    param[5] = inv ;                // IQ inversion
    writecmd ( CMD_SETPACKETPARAMS, param, 6 ) ;
}

// configure packet handling for FSK
static void SetPacketParamsFsk (u2_t rps, int len)
{
    uint8_t param[9];
    param[0] = 0x00; // TX preamble length 40 bits / 5 bytes
    param[1] = 0x28;
    param[2] = 0x05; // RX preamble detector length 16 bits
    param[3] = 0x18; // sync word length 24 bits / 3 bytes
    param[4] = 0x00; // node address filtering disabled
    param[5] = 0x01; // variable size packets, length is included
    param[6] = len;  // payload length
    param[7] = getNocrc(rps) ? CRC_OFF : CRC_2_BYTE_INV; // off or CCITT
    param[8] = 0x01; // whitening enabled
    writecmd(CMD_SETPACKETPARAMS, param, 9);
}

// clear irq register
void ClearIrqStatus (uint16_t mask)
{
    uint8_t buf[2] = { mask >> 8, mask & 0xFF };
    writecmd(CMD_CLEARIRQSTATUS, buf, 2);
}

// stop timer on preamble detection or header/syncword detection
static void StopTimerOnPreamble (uint8_t enable)
{
    writecmd(CMD_STOPTIMERONPREAMBLE, &enable, 1);
}

// set number of symbols for reception
static void SetLoRaSymbNumTimeout (uint8_t nsym)
{
    writecmd(CMD_SETLORASYMBNUMTIMEOUT, &nsym, 1);
}


// GetIrqStatus(), return irq register in 10 bits
// Bit      Meaning
// ---      ------------------------------
//  0       TXDONE
//  1       RXDONE
//  2       PreambleDetected
//  3       SyncDetected
//  4       HeaderValid
//  5       HeaderErr
//  6       CRC error (for LoRa)
//  7       Channel activity detection finished
//  8       CadDetected
//  9       Time-out
uint16_t GetIrqStatus (void)
{
    uint8_t buf[2] ;

    readcmd ( CMD_GETIRQSTATUS, buf, 2 ) ;              // Get status bits
    lastIrqStatus = ( buf[0] << 8) | buf[1] ;           // Convert to 16 bits value
    return  lastIrqStatus ;                             // Return the value
}


uint16_t GetLastIrqStatus (void)
{
    return  lastIrqStatus ;                             // Return the last read IRQ status
}



// get signal quality of received packet for LoRa
static void GetPacketStatusLora (s1_t *rssi, s1_t *snr) {
    uint8_t buf[3];
    readcmd(CMD_GETPACKETSTATUS, buf, 3);
    *rssi = -buf[0] / 2 + RSSI_OFF;
    *snr = buf[1] * SNR_SCALEUP / 4;
}

// get signal quality of received packet for FSK
static s1_t GetPacketStatusFsk (void)
{
    uint8_t buf[3];
    readcmd(CMD_GETPACKETSTATUS, buf, 3);
    return -buf[2] / 2 + RSSI_OFF; // RssiAvg
}

// set and enable irq mask for dio1
static void SetDioIrqParams (uint16_t mask)
{
    // There are 4 masks.  Mask 0 and 1 are used
    uint8_t param[] = { mask >> 8, mask & 0xFF, mask >> 8, mask & 0xFF, 0x00, 0x00, 0x00, 0x00 };
    writecmd(CMD_SETDIOIRQPARAMS, param, 8);
}

// set tx power (in dBm)
static void SetTxPower (int pw)
{
    // high power PA: -9 ... +22 dBm
    if (pw > 22) pw = 22;
    if (pw < -9) pw = -9;
    // Better Resistance of the radio Tx to Antenna Mismatch
    WriteReg ( REG_TX_CLAMP, ReadReg ( REG_TX_CLAMP ) | ( 0x0F << 1 ) ) ;
    // set PA config (and reset OCP to 140mA)
    writecmd(CMD_SETPACONFIG, (const uint8_t[]) { 0x04, 0x07, 0x00, 0x01 }, 4);
    // set tx params
    uint8_t txparam[2] ;
    txparam[0] = (uint8_t) pw ;
    txparam[1] = 0x04 ;                         // ramp time 200us TCXO
    writecmd ( CMD_SETTXPARAMS, txparam, 2 ) ;
}

// set sync word for LoRa (probably default)
static void SetSyncWordLora ( uint16_t syncword )
{
    uint8_t buf[2] = { syncword >> 8, syncword & 0xFF } ;
    WriteRegs ( REG_LORASYNCWORDMSB, buf, 2 ) ;
}

// set sync word for FSK
static void SetSyncWordFsk (uint32_t syncword)
{
    uint8_t buf[3] = { syncword >> 16, syncword >> 8, syncword & 0xFF };
    WriteRegs(REG_SYNCWORD0, buf, 3);
}

