Edzelf/Basicmac-STM32WLE5/lib/IBM LMIC framework/src/lmic/radio-LoRa-E5.c
// set seed for FSK data whitening
static void SetWhiteningSeed (uint16_t seed)
{
    uint8_t buf[2];
    buf[0] = (ReadReg(REG_WHITENINGMSB) & 0xFE) | ((seed >> 8) & 0x01); // don't modify the top-most 7 bits!
    buf[1] = seed;
    WriteRegs(REG_WHITENINGMSB, buf, 2);
}

// set CRC seed and polynomial for FSK
static void SetCrc16 (uint16_t seed, uint16_t polynomial)
{
    // set seed
    uint8_t buf[2] = { seed >> 8, seed & 0xFF };
    WriteRegs(REG_CRCINITVALMSB, buf, 2);
    // set polynomial
    buf[0] = polynomial >> 8;
    buf[1] = polynomial;
    WriteRegs(REG_CRCPOLYVALMSB, buf, 2);
}

void radio_sleep (void)
{
    // cache sleep state to avoid unneccessary wakeup (waking up from cold sleep takes about 4ms)
    if ( state.sleeping == 0 )
    {
        SetSleep ( SLEEP_COLD ) ;
        state.sleeping = 1 ;
    }
}

// Do config common to all RF modes
static void CommonSetup (void)
{
    SetRegulatorMode ( REGMODE_DCDC ) ;
    SetRfSwitchCtrl ( 0 ) ;                     // Not controlled by DIO
    SetTcxoMode() ;
///    if (hal_dio2_controls_rxtx())
///        SetDIO2AsRfSwitchCtrl(1);
///    if (hal_dio3_controls_tcxo())
///        SetDIO3AsTcxoCtrl();
}

static uint32_t GetRandom (void) __attribute__((__unused__)); // Ok if unused
static uint32_t GetRandom (void) {
    uint32_t value;

    // Set up oscillator and rx/tx
    CommonSetup();

    // continuous rx
    SetRx(0xFFFFFF);
    // wait 1ms
    hal_waitUntil(os_getTime() + ms2osticks(1));
    // read random register
    ReadRegs(REG_RANDOMNUMBERGEN0, (uint8_t*)&value, sizeof(value));
    // standby
    SetStandby(STDBY_RC);
    return value;
}

static void txlora (void)
{
    CommonSetup();
    SetStandby(STDBY_RC);
    SetPacketType(PACKET_TYPE_LORA);
    SetRfFrequency(LMIC.freq);
    SetModulationParamsLora(LMIC.rps);
    SetPacketParamsLora(LMIC.rps, LMIC.dataLen, 0);
    SetTxPower(LMIC.txpow + LMIC.brdTxPowOff);
    SetSyncWordLora(0x3444);
    WriteFifo(LMIC.frame, LMIC.dataLen);
    ClearIrqStatus(IRQ_ALL);
    SetDioIrqParams(IRQ_TXDONE | IRQ_TIMEOUT);
    // enable IRQs in HAL
    //hal_irqmask_set(HAL_IRQMASK_DIO1);
    // antenna switch / power accounting
    hal_ant_switch ( HAL_ANTSW_TX ) ;
    // now we actually start the transmission
    BACKTRACE();
    SetTx ( 64000 ) ;           // timeout 10s (should not happen, TXDONE irq will be raised)
}

static void txfsk (void)
{
    CommonSetup();
    SetStandby(STDBY_RC);
    SetPacketType(PACKET_TYPE_FSK);
    SetRfFrequency(LMIC.freq);
    SetModulationParamsFsk();
    SetPacketParamsFsk(LMIC.rps, LMIC.dataLen);
    SetCrc16(0x1D0F, 0x1021); // CCITT
    SetWhiteningSeed(0x01FF);
    SetSyncWordFsk(0xC194C1);
    SetTxPower(LMIC.txpow + LMIC.brdTxPowOff);
    WriteFifo(LMIC.frame, LMIC.dataLen);
    ClearIrqStatus(IRQ_ALL);
    SetDioIrqParams(IRQ_TXDONE | IRQ_TIMEOUT);
    hal_irqmask_set(HAL_IRQMASK_DIO1) ;                     // enable IRQs in HAL

    // antenna switch / power accounting
    hal_ant_switch(HAL_ANTSW_TX);

    // now we actually start the transmission
    BACKTRACE();
    SetTx(64000); // timeout 1s (should not happen, TXDONE irq will be raised)
}

void radio_cw (void) {
    CommonSetup();
    SetStandby(STDBY_RC);
    SetRfFrequency(LMIC.freq);
    SetTxPower(LMIC.txpow + LMIC.brdTxPowOff);
    ClearIrqStatus(IRQ_ALL);

    // antenna switch / power accounting
    hal_ant_switch(HAL_ANTSW_TX);

    // start tx of wave (indefinitely, ended by RADIO_STOP)
    BACKTRACE();
    SetTxContinuousWave();
}

void radio_starttx (bool txcontinuous) {
    if (txcontinuous) {
        // XXX: This is probably not right. In 2.2, Semtech changed the
        // 127x driver to rename txsw to radio_cw, but
        // radio_starttx(true) now uses txfsk/txlora in continuous mode
        // (which is apparently different from radio_cw), so that needs
        // to be impliemented here as well
        radio_cw();
    } else {
        if (isFsk(LMIC.rps)) { // FSK modem
            txfsk();
        } else { // LoRa modem
            txlora();
        }
        // the radio will go back to STANDBY mode as soon as the TX is finished
        // the corresponding IRQ will inform us about completion.
    }
}

static void rxfsk (bool rxcontinuous) {
    // configure radio (needs rampup time)
    ostime_t t0 = os_getTime();
    CommonSetup();
    SetStandby(STDBY_RC);
    SetPacketType(PACKET_TYPE_FSK);
    SetRfFrequency(LMIC.freq);
    SetModulationParamsFsk();
    SetPacketParamsFsk(LMIC.rps, 255);
    SetCrc16(0x1D0F, 0x1021); // CCITT
    SetWhiteningSeed(0x01FF);
    SetSyncWordFsk(0xC194C1);
    StopTimerOnPreamble(0);
    // FSK interrupts: TXDONE, RXDONE, PREAMBLEDETECTED, SYNCWORDVALID, CRCERR, TIMEOUT
    SetDioIrqParams(IRQ_RXDONE | IRQ_TIMEOUT);
    ClearIrqStatus(IRQ_ALL);

    // enter frequency synthesis mode (become ready for immediate rx)
    SetFs();

    // enable IRQs in HAL
    hal_irqmask_set(HAL_IRQMASK_DIO1);

    ostime_t now = os_getTime();
    if (!rxcontinuous && LMIC.rxtime - now < 0) {
        debug_printf("WARNING: rxtime is %ld ticks in the past! (ramp-up time %ld ms / %ld ticks)\r\n",
                     now - LMIC.rxtime, osticks2ms(now - t0), now - t0);
    }

    // now receive (lock interrupts only for final fine tuned rx timing...)
    hal_disableIRQs();
    if (rxcontinuous) { // continous rx
        BACKTRACE();
        // enable antenna switch for RX (and account power consumption)
        hal_ant_switch(HAL_ANTSW_RX);
        // rx infinitely (no timeout, until rxdone, will be restarted)
        SetRx(0);
    } else { // single rx
        BACKTRACE();
        // busy wait until exact rx time
        hal_waitUntil(LMIC.rxtime);
        // enable antenna switch for RX (and account power consumption)
        hal_ant_switch(HAL_ANTSW_RX);
        // rx for max LMIC.rxsyms symbols (rxsyms = nbytes for FSK)
        SetRx((LMIC.rxsyms << 9) / 50); // nbytes * 8 * 64 * 1000 / 50000
    }
    hal_enableIRQs();
}

static void rxlora (bool rxcontinuous) {
    // configure radio (needs rampup time)
    // 30-june-2023, ES: SetLoRaSymbNumTimeout ( LMIC.rxsyms ) causes problems on some models.
    // It generates a time-out on receive of Join accept.
    // So I use a normal time-out instead.  See SetRx().
    ostime_t t0 = os_getTime();
    CommonSetup();
    SetStandby(STDBY_RC);
    SetPacketType(PACKET_TYPE_LORA);
    SetRfFrequency(LMIC.freq);
    SetModulationParamsLora(LMIC.rps);
    SetPacketParamsLora(LMIC.rps, 255, !LMIC.noRXIQinversion);
    SetSyncWordLora(0x3444);
    StopTimerOnPreamble(0);
    //debug_printf ( "rxlora SymbNumTimeout set to %d\n",
    //               LMIC.rxsyms ) ;
    //SetLoRaSymbNumTimeout(LMIC.rxsyms);
    SetLoRaSymbNumTimeout(0); // ES: Use normal time-out
    SetDioIrqParams(IRQ_RXDONE | IRQ_TIMEOUT);
    ClearIrqStatus(IRQ_ALL);
    // enter frequency synthesis mode (become ready for immediate rx)
    SetFs();
    // enable IRQs in HAL
    hal_irqmask_set(HAL_IRQMASK_DIO1); //??
    ostime_t now = os_getTime();
    if (!rxcontinuous && LMIC.rxtime - now < 0) {
        // Print before disabling IRQs, to work around deadlock on some
        // Arduino cores that does not really support printing without IRQs
        //debug_printf("WARNING: rxtime is %ld ticks in the past! (ramp-up time %ld ms / %ld ticks)\r\n",
        //             now - LMIC.rxtime, osticks2ms(now - t0), now - t0);
        // delay ( 50 ) ;
    }
    // now receive (lock interrupts only for final fine tuned rx timing...)
    hal_disableIRQs();
    BACKTRACE();
    // enable antenna switch for RX (and account power consumption)
    hal_ant_switch(HAL_ANTSW_RX);
    if (rxcontinuous) {     // continous rx
        // rx infinitely (no timeout, until rxdone, will be restarted)
        SetRx(0);
    } else { // single rx
        // busy wait until exact rx time
        hal_waitUntil(LMIC.rxtime);
        // rx for max LMIC.rxsyms symbols
        // SetRx(0);        // (infinite, timeout set via SetLoRaSymbNumTimeout)
        SetRx(500 << 6);    // Use normal timeout (half the receive window)
    }
    hal_enableIRQs();
    debug_printf ( "rxlora t0 is %t, now is %t, rxtime is %t, delta is %d msec\n",
                   t0, now, LMIC.rxtime, osticks2ms ( LMIC.rxtime - now ) ) ;
}

void radio_cca () {
    LMIC.rssi = -127;       //XXX:TBD
}

void radio_cad (void) {
    // not yet...
    ASSERT(0);
}

void radio_startrx (bool rxcontinuous) {
    if (isFsk(LMIC.rps)) { // FSK modem
        rxfsk(rxcontinuous);
    } else { // LoRa modem
        rxlora(rxcontinuous);
    }
}

