Edzelf/Basicmac-STM32WLE5/lib/IBM LMIC framework/src/lmic/radio-LoRa-E5.c
// reset radio
static void radio_reset (void)
{
    // drive RST pin low
    bool has_reset = hal_pin_rst(0);

    // If reset is not connected, just continue and hope for the best
    if (!has_reset)
        return;

    // wait > 100us
    hal_waitUntil(os_getTime() + ms2osticks(1));

    // configure RST pin floating
    hal_pin_rst(2);

    // wait 1ms?
    hal_waitUntil(os_getTime() + ms2osticks(1));

    // check reset value
    ASSERT( ReadReg(REG_LORASYNCWORDLSB) == 0x24 );

    // initialize state
    state.sleeping = 0;
}

void radio_init ( bool calibrate )
{
    static bool once = true ;

    if ( once )
    {
      once = false ;
      rhandle.Init.BaudratePrescaler = 0 ;
      rhandle.ErrorCode = 0 ;
      rhandle.State = HAL_SUBGHZ_STATE_RESET ;
      rstat = HAL_SUBGHZ_Init ( &rhandle ) ;          // Init access to radio module
      ASSERT ( rstat == HAL_OK ) ;
    }
    hal_disableIRQs();
    // reset radio (FSK/STANDBY)
    radio_reset();
    // check reset value of LSB syncword
    ASSERT ( ReadReg(REG_LORASYNCWORDLSB) == 0x24 ) ;

    if (calibrate)
    {
        CalibrateImage ( LMIC.freq ) ;
    }
    // go to SLEEP mode
    radio_sleep() ;
    hal_enableIRQs() ;
}

void radio_generate_random ( u4_t *words, u1_t len )
{
    while (len--)
    {
        *words++ = GetRandom () ;
    }
}

// Run by irqjob if a new IRQ status is seen
bool radio_irq_process ( ostime_t irqtime, u1_t diomask )
{
    (void)diomask; // unused

    uint16_t irqflags = GetLastIrqStatus() ;
    debug_printf ( "irq_process, IRQ is 0x%04X\r\n", irqflags ) ;
    // dispatch modem
    if ( isFsk ( LMIC.rps ) )
    {   // FSK modem
        if ( irqflags & IRQ_TXDONE)
        {   // TXDONE
            BACKTRACE() ;
            // save exact tx time
            LMIC.txend = irqtime - FSK_TXDONE_FIXUP ;
        }
        else if ( irqflags & IRQ_RXDONE )
        {   // RXDONE
            BACKTRACE();
            // read rx quality parameters
            LMIC.rssi = GetPacketStatusFsk();
            LMIC.snr = 0; // N/A
            // read FIFO
            LMIC.dataLen = ReadFifo(LMIC.frame);
            // save exact rx timestamps
            LMIC.rxtime  = irqtime - FSK_RXDONE_FIXUP; // end of frame timestamp
            LMIC.rxtime0 = LMIC.rxtime - calcAirTime(LMIC.rps, LMIC.dataLen); // beginning of frame timestamp
#ifdef DEBUG_RX
            debug_printf ( "RX[rssi=%d,len=%d]: %h\r\n",
                           LMIC.rssi - RSSI_OFF, LMIC.dataLen,
                           LMIC.frame, LMIC.dataLen ) ;
#endif
        }
        else if ( irqflags & IRQ_TIMEOUT )
        {   // TIMEOUT
            BACKTRACE() ;
            // indicate timeout
            LMIC.dataLen = 0 ;
#ifdef DEBUG_RX
            debug_printf ( "RX: TIMEOUT\r\n" ) ;
#endif
        }
        else
        {
            // unexpected irq
            debug_printf ( "UNEXPECTED RADIO IRQ %04x (after %ld ticks, %.1Fms)\r\n",
                           irqflags, irqtime - LMIC.rxtime,
                           osticks2us ( irqtime - LMIC.rxtime ), 3 ) ;
            TRACE_VAL ( irqflags ) ;
            ASSERT(0) ;
        }
    }
    else
    {   // LORA modem
        if ( irqflags & IRQ_TXDONE )
        {   // TXDONE
            BACKTRACE() ;
            // save exact tx time
            LMIC.txend = irqtime - LORA_TXDONE_FIXUP ;
        }
        else if ( irqflags & IRQ_RXDONE )
        {   // RXDONE
            BACKTRACE();
            // read rx quality parameters
            GetPacketStatusLora ( &LMIC.rssi, &LMIC.snr ) ;
            // read FIFO
            LMIC.dataLen = ReadFifo ( LMIC.frame ) ;
            // save exact rx timestamps
            LMIC.rxtime = irqtime ; // end of frame timestamp
            if ( getBw ( LMIC.rps) == BW125 )
            {
                LMIC.rxtime -= LORA_RXDONE_FIXUP_125[getSf ( LMIC.rps )] ;
            }
            else if ( getBw (LMIC.rps ) == BW500 )
            {
                LMIC.rxtime -= LORA_RXDONE_FIXUP_500[getSf(LMIC.rps)];
            }
            LMIC.rxtime0 = LMIC.rxtime - calcAirTime ( LMIC.rps, LMIC.dataLen ) ; // beginning of frame timestamp
#ifdef DEBUG_RX
            debug_printf ( "RX[rssi=%d,snr=%.2F,len=%d]: %h\r\n",
                         LMIC.rssi - RSSI_OFF, (s4_t)(LMIC.snr * 100 / SNR_SCALEUP), 2,
                         LMIC.dataLen, LMIC.frame, LMIC.dataLen);
#endif
        }
        else if ( irqflags & IRQ_TIMEOUT )
        {   // TIMEOUT
            BACKTRACE() ;
            // indicate timeout
            LMIC.dataLen = 0;
#ifdef DEBUG_RX
            debug_printf ( "RX: TIMEOUT\r\n" ) ;
#endif
        }
        else
        {
            // unexpected irq
            debug_printf ( "UNEXPECTED RADIO IRQ %04x\r\n", irqflags ) ;
            TRACE_VAL ( irqflags ) ;
            ///ASSERT(0) ;
        }
    }
    SetDioIrqParams ( 0 ) ;                 // mask all IRQs
    ClearIrqStatus ( IRQ_ALL ) ;            // clear IRQ flags
    return true ;                           // radio operation completed
}

#endif
